<template>
  <div class="table">
    <Navbar />
    <b-container>
      <b-table striped hover :items="items"  :fields="fields"></b-table>

    </b-container>
  </div>
</template>
<script>
import Navbar from "@/components/Navbar";
export default {
  components: {Navbar},
  data() {
    return {
      fields: ['Игрок', 'Дата_и_время', 'Тип', 'Голова', 'Тело', 'Левая_рука', 'Правая_рука', 'Левая_нога', 'Правая_нога'],
      items: [
        { Игрок: 'Игрок 1', Дата_и_время: '10-09-2020 14:19', Тип: 'Удар', Голова: 'Да', Тело: 'Нет', Левая_рука: 'Нет', Правая_рука: 'Нет', Левая_нога: 'Нет', Правая_нога: 'Нет' },
        { Игрок: 'Игрок 2', Дата_и_время: '10-09-2020 14:22', Тип: 'Защита', Голова: 'Нет', Тело: 'Нет', Левая_рука: 'Да', Правая_рука: 'Нет', Левая_нога: 'Нет', Правая_нога: 'Нет' },
        { Игрок: 'Игрок 2', Дата_и_время: '10-09-2020 14:19', Тип: 'Удар', Голова: 'Нет', Тело: 'Да', Левая_рука: 'Нет', Правая_рука: 'Нет', Левая_нога: 'Нет', Правая_нога: 'Нет' },
        { Игрок: 'Игрок 1', Дата_и_время: '10-09-2020 14:22', Тип: 'Защита', Голова: 'Нет', Тело: 'Нет', Левая_рука: 'Нет', Правая_рука: 'Нет', Левая_нога: 'Нет', Правая_нога: 'Да' }
      ]
    }
  }
}
</script>